Repository: agordeev/my-drugs-app
Catalog: lib/l10n/intl_*.arb
Languages: ru

# appTitle
source: My Drugs
ru: Мои лекарства

# buttonEdit
source: Edit
ru: Изменить

# buttonDelete
source: Delete
ru: Удалить

# validationEmptyRequiredField
source: Please fill this field
ru: Заполните это поле

# validationInvalidExpiryDate
source: Please enter a valid expiry date
ru: Введите верный срок годности

# unknownRouteMessage
source: We're sorry, but there was an error in navigation. Please try again or contact us.
ru: Произошла ошибка навигации. Пожалуйста, попробуйте еще раз или свяжитесь с нами.

# drugListTotalItems
source: {itemsCount, plural, zero{No items} one{1 item} other{{itemsCount} items}}
ru: {itemsCount, plural, zero{Нет лекарств} one{{itemsCount} лекарство} few{{itemsCount} лекарства} many{{itemsCount} лекарств} other{{itemsCount} лекарств}}

# drugListTotalItemsSelected
source: {itemsCount, plural, zero{No items selected} one{1 item selected} other{{itemsCount} items selected}}
ru: {itemsCount, plural, zero{Выбрано 0 лекарств} one{Выбрано {itemsCount} лекарство} few{Выбрано {itemsCount} лекарства} many{Выбрано {itemsCount} лекарств} other{Выбрано {itemsCount} лекарств}}

# drugListNoItems
source: No drugs added yet
ru: Нет добавленных лекарств

# drugListExpiredGroupTitle
source: Expired
ru: Просроченные

# drugListNotExpiredGroupTitle
source: Not Expired
ru: Непросроченные

# drugListExpiresOnLabel
source: Expires On
ru: Годен до

# manageDrugAddDrugModeTitle
source: Add Drug
ru: Добавить лекарство

# manageDrugAddDrugModeActionButtonTitle
source: Add
ru: Добавить

# manageDrugEditDrugModeTitle
source: Edit Drug
ru: Изменить лекарство

# manageDrugEditDrugModeActionButtonTitle
source: Save
ru: Сохранить

# manageDrugNameFieldLabel
source: Name
ru: Наименование

# manageDrugNameFieldHint
source: Aspirin
ru: Аспирин

# manageDrugExpiresOnFieldLabel
source: Expires On
ru: Годен до
